In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame({'key1':['a','a','b','b','a'],
                'key2':['one','two','one','two','one'],
                'data1':np.random.randn(5),
                'data2':np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one  0.389001 -0.583105
1    a  two -1.678591 -0.045509
2    b  one  3.221329 -1.545976
3    b  two -2.134226  1.528685
4    a  one  0.230994  0.746088

In [5]:
grouped=df['data1'].groupby(df['key1'])

In [6]:
grouped

In [7]:
grouped.mean()

key1
a   -0.352865
b    0.543552
Name: data1, dtype: float64

In [8]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()

In [9]:
means

key1  key2
a     one     0.309997
      two    -1.678591
b     one     3.221329
      two    -2.134226
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a     0.309997 -1.678591
b     3.221329 -2.134226

In [11]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [12]:
years=np.array([2005,2005,2006,2005,2006])

In [13]:
df['data1'].groupby([states, years]).mean()

California  2005   -1.678591
            2006    3.221329
Ohio        2005   -0.872613
            2006    0.230994
Name: data1, dtype: float64

In [14]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.352865  0.039158
b     0.543552 -0.008646

In [15]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.309997  0.081492
     two  -1.678591 -0.045509
b    one   3.221329 -1.545976
     two  -2.134226  1.528685

In [17]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [18]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.389001 -0.583105
1    a  two -1.678591 -0.045509
4    a  one  0.230994  0.746088
b
  key1 key2     data1     data2
2    b  one  3.221329 -1.545976
3    b  two -2.134226  1.528685

In [21]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.389001 -0.583105
4    a  one  0.230994  0.746088
('a', 'two')
  key1 key2     data1     data2
1    a  two -1.678591 -0.045509
('b', 'one')
  key1 key2     data1     data2
2    b  one  3.221329 -1.545976
('b', 'two')
  key1 key2     data1     data2
3    b  two -2.134226  1.528685

In [22]:
pieces=dict(list(df.groupby('key1')))

In [23]:
pieces['b']

  key1 key2     data1     data2
2    b  one  3.221329 -1.545976
3    b  two -2.134226  1.528685

In [24]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped=df.groupby(df.dtypes, axis=1)

In [26]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.389001 -0.583105
1 -1.678591 -0.045509
2  3.221329 -1.545976
3 -2.134226  1.528685
4  0.230994  0.746088
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [28]:
#列名
candy1=df.groupby('key1')['data1']

In [30]:
candy1.mean()

key1
a   -0.352865
b    0.543552
Name: data1, dtype: float64

In [31]:
#列名称数组
candy2=df.groupby('key1')[['data2']]

In [33]:
candy2.mean()

         data2
key1
a     0.039158
b    -0.008646

In [34]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.081492
     two  -0.045509
b    one  -1.545976
     two   1.528685

In [35]:
s_grouped=df.groupby(['key1','key2'])['data2']

In [37]:
s_grouped.mean()

key1  key2
a     one     0.081492
      two    -0.045509
b     one    -1.545976
      two     1.528685
Name: data2, dtype: float64